#ifndef __SYSTEMCORE_H_
#define __SYSTEMCORE_H_




/***********************************************************************************************
*函数名 		: core_DelayUs(unsigned char dl_t)
*函数功能描述 	: 内核短延时
*函数参数 		: unsigned char dl_t：延时计数约等于空指令周期
*函数返回值 	: 无
***********************************************************************************************/
void core_DelayUs(unsigned char dl_t);


/***********************************************************************************************
*函数名 		: void zd_systemInit(void)
*函数功能描述 	: 初始化系统时钟
*函数参数 		: 无
*函数返回值 	: 无
***********************************************************************************************/
void mof_systemInit(void);


/***********************************************************************************************
*函数名 		: void zd_timerInit(unsigned char timerChannel)
*函数功能描述 	: 初始化定时器
*函数参数 	: unsigned char timerChannel:定时器号,
		  unsigned long _Us：定时器时间
*函数返回值 	: 无
***********************************************************************************************/
//void zd_timerInit(unsigned char timerChannel);


#endif