/************************************************************************************************ 

*************************************************************************************************/
#include "com_include_core.h"

/***********************************************************************************************
*函数名 		: core_DelayUs(unsigned char dl_t)
*函数功能描述 	: 内核短延时
*函数参数 		: unsigned char dl_t：延时计数约等于空指令周期
*函数返回值 	: 无
***********************************************************************************************/
void core_DelayUs(unsigned char dl_t)
{
	unsigned char a;

	for(a=0;a<dl_t;a++)
	{
		
		MOF_NOP;
	}
}  


/***********************************************************************************************
*函数名 		: void zd_systemInit(void)
*函数功能描述 	: 初始化系统时钟
*函数参数 		: 无
*函数返回值 	: 无
***********************************************************************************************/
void mof_systemInit(void)
{
	//关闭总中断
	MOF_GIE_DISABLE;

	//BOR默认打开无需配置


	//系统时钟初始化
	MOF_FSYS_INIT;
	
	//初始化看门狗
	MOF_WDT_INIT;
	
	//中断初始化清零
	MOF_INTERRUPT_INIT;  					//暂禁止所有中断
	
	//端口初始化(默认值)
	MOF_PORT_INIT;
}

