//******************************************************************************
//Copyright(C) 2020-2021 zhejiang zhida dianzikeji Co., Ltd
//浙江智达电子科技有限公司
//File name:      key.h
//Author:         zzg
//Version:        Ver0.1
//Date:           2021-4-25
//Description:    按键
//History:
//******************************************************************************
#ifndef __RFKEY_DRV_H__
#define __RFKEY_DRV_H__



//声明外部函数******************************************************************
/***********************************************************************************************
*函数名 		: void zd_touchkeyInit(void)
*函数功能描述 	: 初始化RF遥控按键
*函数参数 		: 无
*函数返回值 	: 无
***********************************************************************************************/
void zd_rfkeyInit(void);


/***********************************************************************************************
*函数名 		: unsigned long zd_touchkeyRead(void)
*函数功能描述 	: 获取RF遥控按键值
*函数参数 		: unsigned long *keyval ：按键值地址指针
*函数返回值 	: unsigned char  按键值状态  1：键值有更新  0：键值无更新
***********************************************************************************************/
unsigned char zd_rfkeyRead(unsigned long *keyval);


/***********************************************************************************************
*函数名 		: void __ZD_GetRfKeyValue(void)
*函数功能描述 	: 中断采集RF遥控信号
*函数参数 		: 无
*函数返回值 	: 无
***********************************************************************************************/
void __ZD_GetRfKeyValue(void);


#endif 


/************************ (C) COPYRIGHT zhejiang zhida *****END OF FILE****/